# Install mas-cli (https://github.com/mas-cli/mas) to pull items from the Apple Store.
brew "mas"

# Install fish shell (https://fishshell.com/).
brew "fish"

# Install utilities.
brew "wget"
brew "autojump"
brew "youtube-dl"
brew "ssh-copy-id"
brew "ical-buddy"
brew "rbenv"
brew "asdf"
cask "lastpass"
brew "lastpass-cli"
cask "jumpcut"
cask "caffeine"
cask "flux"
cask "hammerspoon"
cask "xbar"
cask "veracrypt"

# Install fonts.
cask "homebrew/cask-fonts/font-jetbrains-mono"

# Install web browsers.
cask "homebrew/cask-versions/firefox-developer-edition"

# Install chat and social media clients.
cask "slack"
cask "discord"
cask "tweeten"

# Install gaming clients.
cask "gog-galaxy"
cask "steam"

# Install video tools.
cask "vlc"

# Install programming tools.
cask "goland"
cask "phpstorm"
cask "webstorm"
cask "datagrip"
cask "macvim"
cask "iterm2"
mas "Xcode", id: 497799835
